# 전국 팔도 좌표
LOCATION_COORDS = {
  '서울': (126.9780, 37.5665),
  '경기': (127.0276, 37.2904),
  '강원': (127.9181, 37.1391),
  '충청': (127.4710, 36.8104),
  '경상': (128.5101, 35.8714),
  '전라': (126.8519, 35.1796),
  '제주': (126.5324, 33.4890),
  '인천': (126.7100, 37.4563),
  '부산': (129.0750, 35.1798),
}

# 봉고 모델
BONGO_MODELS = {
    "bongo3": {
        "id": "3772", 
        "name": "기아 봉고3",
        "lineup_ids": [53587, 53588, 53589, 53590, 53591, 53592, 53593, 53594, 53595, 53596, 53597, 53598, 53599, 53600]  # None이면 모든 라인업, 리스트로 지정하면 해당 라인업만
    },
    "bongo3_ev": {
        "id": "4404", 
        "name": "기아 봉고3 EV",
        "lineup_ids": [50833, 53296]
    },
}

# 포터 모델
PORTER_MODELS = {
    "porter2": {
        "id": "1901", 
        "name": "현대 포터2",
        "lineup_ids": None  # None이면 모든 라인업 크롤링
    },
    "porter2_ev": {
        "id": "4399", 
        "name": "현대 포터2 일렉트릭",
        "lineup_ids": None
    },
}
